sqf-ice/OpenLoWPAN/dongle/ping-pong/cc2520_reg.h
#ifndef CC2520_REG_H
#define CC2520_REG_H

#define CC2520_OP_SNOP          0x00
#define CC2520_OP_IBULD         0x02
#define CC2520_OP_SIBUFEX       0x03
#define CC2520_OP_SSAMPLECCA    0x04
#define CC2520_OP_SRES          0x0F
#define CC2520_OP_MEMRD         0x10
#define CC2520_OP_MEMWR         0x20
#define CC2520_OP_RXBUF         0x30
#define CC2520_OP_RXBUFCP       0x38
#define CC2520_OP_RXBUFMOV      0x32
#define CC2520_OP_TXBUF         0x3A
#define CC2520_OP_TXBUFCP       0x3E
#define CC2520_OP_RANDOM        0x3C
#define CC2520_OP_SXOSCON       0x40
#define CC2520_OP_STXCAL        0x41
#define CC2520_OP_SRXON         0x42
#define CC2520_OP_STXON         0x43
#define CC2520_OP_STXONCCA      0x44
#define CC2520_OP_SRFOFF        0x45
#define CC2520_OP_SXOSCOFF      0x46
#define CC2520_OP_SFLUSHRX      0x47
#define CC2520_OP_SFLUSHTX      0x48
#define CC2520_OP_SACK          0x49
#define CC2520_OP_SACKPEND      0x4A
#define CC2520_OP_SNACK         0x4B
#define CC2520_OP_SRXMASKBITSET 0x4C
#define CC2520_OP_SRXMASKBITCLR 0x4D
#define CC2520_OP_SRXMASKAND    0x4E
#define CC2520_OP_SRXMASKOR     0x4F
#define CC2520_OP_MEMCP         0x50
#define CC2520_OP_MEMCPR        0x52
#define CC2520_OP_MEMXCP        0x54
#define CC2520_OP_MEMXWR        0x56
#define CC2520_OP_BCLR          0x58
#define CC2520_OP_BSET          0x59
#define CC2520_OP_CTR           0x60
#define CC2520_OP_CBCMAC        0x64
#define CC2520_OP_UCBCMAC       0x66
#define CC2520_OP_CCM           0x68
#define CC2520_OP_UCCM          0x6A
#define CC2520_OP_ECB           0x70
#define CC2520_OP_ECBO          0x72
#define CC2520_OP_ECBX          0x74
#define CC2520_OP_INC           0x78
#define CC2520_OP_ABORT         0x7F
#define CC2520_OP_REGRD         0x80
#define CC2520_OP_REGWR         0xC0

// FREG registers
#define CC2520_REG_FRMFILT0     0x00
#define CC2520_REG_FRMFILT1     0x01
#define CC2520_REG_SRCMATCH     0x02
#define CC2520_REG_SRCSHORTEN0  0x04
#define CC2520_REG_SRCSHORTEN1  0x05
#define CC2520_REG_SRCSHORTEN2  0x06
#define CC2520_REG_SRCEXTEN0    0x08
#define CC2520_REG_SRCEXTEN1    0x09
#define CC2520_REG_SRCEXTEN2    0x0A
#define CC2520_REG_FRMCTRL0     0x0C
#define CC2520_REG_FRMCTRL1     0x0D
#define CC2520_REG_RXENABLE0    0x0E
#define CC2520_REG_RXENABLE1    0x0F
#define CC2520_REG_EXCFLAG0     0x10
#define CC2520_REG_EXCFLAG1     0x11
#define CC2520_REG_EXCFLAG2     0x12
#define CC2520_REG_EXCMASKA0    0x14
#define CC2520_REG_EXCMASKA1    0x15
#define CC2520_REG_EXCMASKA2    0x16
#define CC2520_REG_EXCMASKB0    0x18
#define CC2520_REG_EXCMASKB1    0x19
#define CC2520_REG_EXCMASKB2    0x1A
#define CC2520_REG_EXCBINDX0    0x1C
#define CC2520_REG_EXCBINDX1    0x1D
#define CC2520_REG_EXCBINDY0    0x1E
#define CC2520_REG_EXCBINDY1    0x1F
#define CC2520_REG_GPIOCTRL0    0x20
#define CC2520_REG_GPIOCTRL1    0x21
#define CC2520_REG_GPIOCTRL2    0x22
#define CC2520_REG_GPIOCTRL3    0x23
#define CC2520_REG_GPIOCTRL4    0x24
#define CC2520_REG_GPIOCTRL5    0x25
#define CC2520_REG_GPIOPOLARITY 0x26
#define CC2520_REG_GPIOCTRL     0x28
#define CC2520_REG_DPUCON       0x2A
#define CC2520_REG_DPUSTAT      0x2C
#define CC2520_REG_FREQCTRL     0x2E
#define CC2520_REG_FREQTUNE     0x2F
#define CC2520_REG_TXPOWER      0x30
#define CC2520_REG_TXCTRL       0x31
#define CC2520_REG_FSMSTAT0     0x32
#define CC2520_REG_FSMSTAT1     0x33
#define CC2520_REG_FIFOPCTRL    0x34
#define CC2520_REG_FSMCTRL      0x35
#define CC2520_REG_CCACTRL0     0x36
#define CC2520_REG_CCACTRL1     0x37
#define CC2520_REG_RSSI         0x38
#define CC2520_REG_RSSISTAT     0x39
#define CC2520_REG_RXFIRST      0x3C
#define CC2520_REG_RXFIFOCNT    0x3E
#define CC2520_REG_TXFIFOCNT    0x3F

// SREG registers
#define CC2520_REG_CHIPID       0x40
#define CC2520_REG_VERSION      0x42
#define CC2520_REG_EXTCLOCK     0x44
#define CC2520_REG_MDMCTRL0     0x46
#define CC2520_REG_MDMCTRL1     0x47
#define CC2520_REG_FREQEST      0x48
#define CC2520_REG_RXCTRL       0x4A
#define CC2520_REG_FSCTRL       0x4C
#define CC2520_REG_FSCAL0       0x4E
#define CC2520_REG_FSCAL1       0x4F
#define CC2520_REG_FSCAL2       0x50
#define CC2520_REG_FSCAL3       0x51
#define CC2520_REG_AGCCTRL0     0x52
#define CC2520_REG_AGCCTRL1     0x53
#define CC2520_REG_AGCCTRL2     0x54
#define CC2520_REG_AGCCTRL3     0x55
#define CC2520_REG_ADCTEST0     0x56
#define CC2520_REG_ADCTEST1     0x57
#define CC2520_REG_ADCTEST2     0x58
#define CC2520_REG_MDMTEST0     0x5A
#define CC2520_REG_MDMTEST1     0x5B
#define CC2520_REG_DECTEST0     0x5C
#define CC2520_REG_DECTEST1     0x5D
#define CC2520_REG_ATEST        0x5E
#define CC2520_REG_DACTEST      0x5F
#define CC2520_REG_PTEST0       0x60
#define CC2520_REG_PTEST1       0x61
#define CC2520_REG_RESERVED     0x62
#define CC2520_REG_DPUBIST      0x7A
#define CC2520_REG_ACTBIST      0x7C
#define CC2520_REG_RAMBIST      0x7E

#define CC2520_MEM_FREG                 0x000
#define CC2520_MEM_SREG                 0x040
#define CC2520_MEM_TX_FIFO              0x100
#define CC2520_MEM_RX_FIFO              0x180
#define CC2520_MEM_RAM                  0x200
#define CC2520_MEM_SRC_ADDR_TABLE       0x380
#define CC2520_MEM_SRC_ADDR_MATCH_RES   0x3E0
#define CC2520_MEM_SRC_ADDR_MATCH_CTRL  0x3E4
#define CC2520_MEM_LOCAL_ADDRESS_INFO   0x3EA

#endif
